Revit 2027 API
TableSectionData.IsCellFormattable Method
 Determines whether the cell is formattable or not
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsCellFormattable(
	int nRow,
	int nCol
)
Public Function IsCellFormattable (
	nRow As Integer,
	nCol As Integer
) As Boolean
public:
bool IsCellFormattable(
	int nRow,
	int nCol
)
member IsCellFormattable :
        nRow : int *
        nCol : int -> bool
Parameters
nRow Int32
 The row index of the cell
nCol Int32
 The column index of the cell
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentException |  The given row number nRow is invalid. -or- The given column number nCol is invalid.
See Also
Reference
TableSectionData Class
Autodesk.Revit.DB Namespace